<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"98fa616d49897daae5a1bfddf22e5ede98b1a47ceae55ff08e90545c9a372597","plan_job_ref":"Job Staging Image Build & Push #29 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7329805792","plan_hash":"7ede7f58f4765942364463220ccad6a6ae420a1fa39326eb2e327fdd576d5a54","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 2 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # aws_ecrpublic_repository.fastapi-ecr-public will be updated in-place
!~  resource "aws_ecrpublic_repository" "fastapi-ecr-public" {
        id              = "dev/irezd/fastapi"
        tags            = {}
#        (6 unchanged attributes hidden)

!~      catalog_data {
!~          description       = "This is a containerized images of FastAPI stored on ECR Staging environment" -> "This is a containerized images of FastAPI stored on ECR dev environment"
#            (3 unchanged attributes hidden)
        }
    }

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/dev-fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-docker-image:3" -> "aws_ecs_task_definition.task_definition_1.arn"
#        (16 unchanged attributes hidden)

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.service will be destroyed
  # (because aws_ecs_task_definition.service is not in configuration)
-   resource "aws_ecs_task_definition" "service" {
-       arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-docker-image:3" -> null
-       arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-docker-image" -> null
-       container_definitions    = jsonencode(
            [
-               {
-                   cpu          = 1024
-                   environment  = []
-                   essential    = true
-                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:latest"
-                   memory       = 2048
-                   mountPoints  = []
-                   name         = "fastapi-Staging"
-                   portMappings = [
-                       {
-                           containerPort = 5000
-                           hostPort      = 5000
-                           protocol      = "tcp"
                        },
                    ]
-                   volumesFrom  = []
                },
            ]
        ) -> null
-       cpu                      = "1024" -> null
-       family                   = "dev-fastapi-docker-image" -> null
-       id                       = "dev-fastapi-docker-image" -> null
-       memory                   = "2048" -> null
-       network_mode             = "awsvpc" -> null
-       requires_compatibilities = [
-           "FARGATE",
        ] -> null
-       revision                 = 3 -> null
-       skip_destroy             = false -> null
-       tags                     = {} -> null
-       tags_all                 = {} -> null
    }

  # aws_ecs_task_definition.task_definition_1 will be created
+   resource "aws_ecs_task_definition" "task_definition_1" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu          = 1024
+                   essential    = true
+                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:latest"
+                   memory       = 2048
+                   name         = "dev_FastAPI_definition"
+                   portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
                },
            ]
        )
+       cpu                      = "1024"
+       family                   = "dev-FastAPI-container-image"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = (known after apply)
    }

  # aws_ecs_task_definition.task_definition_2 will be created
+   resource "aws_ecs_task_definition" "task_definition_2" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu          = 1024
+                   essential    = true
+                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:latest"
+                   memory       = 2048
+                   name         = "dev_FastAPI_definition"
+                   portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
                },
            ]
        )
+       cpu                      = "1024"
+       family                   = "prod-FastAPI-container-image"
+       id                       = (known after apply)
+       memory                   = "2048"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = (known after apply)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "td_name" but a value was
found in file "env/dev.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #29](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7329805792)